vsfteam/vsf/source/hal/driver/GigaDevice/GD32H7XX/common/driver.c
const vsf_hw_clk_t VSF_HW_CLK_IRC64MDIV = {
    .clken_region               = VSF_HW_CLKRST_REGION(0x00, 30, 1),// IRC64MEN in RCU.CTL
    .clkrdy_region              = VSF_HW_CLKRST_REGION(0x00, 31, 1),// IRC64MSTB in RCU.CTL
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x31, 16, 2),// IRC64MDIV in RCU.ADDCTL1

    .clk_freq_hz                = IRC64M_VALUE,
    ..clksrc_type               = VSF_HW_CLK_TYPE_CONST,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_SFT,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 3,
};

const vsf_hw_clk_t VSF_HW_CLK_LPIRC4M = {
    .clken_region               = VSF_HW_CLKRST_REGION(0x31, 0, 1), // LPIRC4MEN in RCU.ADDCTL1
    .clkrdy_region              = VSF_HW_CLKRST_REGION(0x31, 1, 1), // LPIRC4MSTB in RCU.ADDCTL1

    .clk_freq_hz                = LPIRC4M_VALUE,
    .clksrc_type                = VSF_HW_CLK_TYPE_CONST,
};

const vsf_hw_clk_t VSF_HW_CLK_IRC32K = {
    .clken_region               = VSF_HW_CLKRST_REGION(0x1D, 0, 1), // IRC32KEN in RCU.RSTSCK
    .clkrdy_region              = VSF_HW_CLKRST_REGION(0x1D, 1, 1), // IRC32KSTB in RCU.RSTSCK

    .clk_freq_hz                = IRC32K_VALUE,
    .clksrc_type                = VSF_HW_CLK_TYPE_CONST,
};

static const vsf_hw_clk_t * const __VSF_HW_CLK_PLL_CLKSEL_MAPPER[4] = {
    &VSF_HW_CLK_IRC64MDIV, &VSF_HW_CLK_LPIRC4M, &VSF_HW_CLK_HXTAL, NULL,
};
static const vsf_hw_clk_t __VSF_HW_CLK_PLL_SRC = {
    .clksel_region              = VSF_HW_CLKRST_REGION(0x26, 16, 2), // PLLSEL in RCU.PLLALL

    .clksel_mapper              = __VSF_HW_CLK_PLL_CLKSEL_MAPPER,
    .clksrc_type                = VSF_HW_CLK_TYPE_SEL,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL0_VCO = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x01, 0, 6), // PLLxPSC in RCU.PLLX
    .clksel_region              = VSF_HW_CLKRST_REGION(0x26, 0, 3), // PLLxRNG/PLLxVCOSEL in RCU.PLLALL
    .clken_region               = VSF_HW_CLKRST_REGION(0x00, 24, 1),// PLLxEN in RCU.CTL
    .clkrdy_region              = VSF_HW_CLKRST_REGION(0x00, 25, 1),// PLLxSTB in RCU.CTL

    .clksrc                     = &__VSF_HW_CLK_PLL_SRC,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .getclk                     = __vsf_hw_pll_get_vco,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_FUNC,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 63,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL1_VCO = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x21, 0, 6), // PLLxPSC in RCU.PLLX
    .clksel_region              = VSF_HW_CLKRST_REGION(0x26, 4, 3), // PLLxRNG/PLLxVCOSEL in RCU.PLLALL
    .clken_region               = VSF_HW_CLKRST_REGION(0x00, 26, 1),// PLLxEN in RCU.CTL
    .clkrdy_region              = VSF_HW_CLKRST_REGION(0x00, 27, 1),// PLLxSTB in RCU.CTL

    .clksrc                     = &__VSF_HW_CLK_PLL_SRC,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .getclk                     = __vsf_hw_pll_get_vco,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_FUNC,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 63,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL2_VCO = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x22, 0, 6), // PLLxPSC in RCU.PLLX
    .clksel_region              = VSF_HW_CLKRST_REGION(0x26, 8, 3), // PLLxRNG/PLLxVCOSEL in RCU.PLLALL
    .clken_region               = VSF_HW_CLKRST_REGION(0x00, 28, 1),// PLLxEN in RCU.CTL
    .clkrdy_region              = VSF_HW_CLKRST_REGION(0x00, 29, 1),// PLLxSTB in RCU.CTL

    .clksrc                     = &__VSF_HW_CLK_PLL_SRC,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .getclk                     = __vsf_hw_pll_get_vco,
    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_FUNC,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 63,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL0P = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x01, 16, 7),// PLLxP in RCU.PLLX
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 25, 1),// PLLxPEN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL0_VCO,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL0Q = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x20, 0, 7), // PLLxQ in RCU.PLLADDCTL
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 23, 1),// PLLxQEN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL0_VCO,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL0R = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x01, 24, 7),// PLLxR in RCU.PLLX
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 24, 1),// PLLxREN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL0_VCO,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL1P = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x21, 16, 7),// PLLxP in RCU.PLLX
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 28, 1),// PLLxPEN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL1_VCO,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL1Q = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x20, 8, 7), // PLLxQ in RCU.PLLADDCTL
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 26, 1),// PLLxPEN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL1_VCO,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};
const vsf_hw_clk_t VSF_HW_CLK_PLL1R = {
    .clkprescaler_region        = VSF_HW_CLKRST_REGION(0x21, 24, 7),// PLLxR in RCU.PLLX
    .clken_region               = VSF_HW_CLKRST_REGION(0x20, 27, 1),// PLLxREN in RCU.PLLADDCTL

    .clksrc                     = &VSF_HW_CLK_PLL1_VCO,
    .clksrc_type                = VSF_HW_CLK_TYPE_CLK,

    .clkprescaler_type          = VSF_HW_CLK_PRESCALER_ADD1_DIV,
    .clkprescaler_min           = 0,
    .clkprescaler_max           = 127,
};
