vsfteam/vsf/source/hal/driver/GigaDevice/GD32H7XX/common/driver.c
    // System Memory, 64K from 0x1FF00000
    vsf_arch_mpu_add_region(0x1FF00000, 64 * 1024,
                            VSF_ARCH_MPU_NON_SHARABLE       |
                            VSF_ARCH_MPU_NON_EXECUTABLE     |
                            VSF_ARCH_MPU_ACCESS_READONLY    |
                            VSF_ARCH_MPU_NON_CACHABLE);

    // AHBs & APBs, 512M from 0x40000000
    vsf_arch_mpu_add_region(0x40000000, 512 * 1024 * 1024,
                            VSF_ARCH_MPU_SHARABLE           |
                            VSF_ARCH_MPU_NON_EXECUTABLE     |
                            VSF_ARCH_MPU_ACCESS_FULL        |
                            VSF_ARCH_MPU_NON_CACHABLE);

    // AXI SRAM, 512K from 0x24000000
    vsf_arch_mpu_add_region(0x24000000, 1 * 1024 * 1024,
                            VSF_ARCH_MPU_NON_SHARABLE       |
                            VSF_ARCH_MPU_EXECUTABLE         |
                            VSF_ARCH_MPU_ACCESS_FULL        |
                            VSF_ARCH_MPU_CACHABLE_WRITE_THROUGH_NOALLOC);

    // AHB SRAM, 32K from 0x30000000
    vsf_arch_mpu_add_region(0x30000000, 32 * 1024,
                            VSF_ARCH_MPU_NON_SHARABLE       |
                            VSF_ARCH_MPU_EXECUTABLE         |
                            VSF_ARCH_MPU_ACCESS_FULL        |
                            VSF_ARCH_MPU_CACHABLE_WRITE_BACK_NOALLOC);

    // User FLASH, 4M from 0x08000000
    vsf_arch_mpu_add_region(0x08000000, 4 * 1024 * 1024,
                            VSF_ARCH_MPU_NON_SHARABLE       |
                            VSF_ARCH_MPU_EXECUTABLE         |
                            VSF_ARCH_MPU_ACCESS_FULL        |
                            VSF_ARCH_MPU_CACHABLE_WRITE_THROUGH_NOALLOC);

    vsf_arch_mpu_enable();
}





/*! \note initialize device driver
 *  \param none
 *  \retval true initialization succeeded.
 *  \retval false initialization failed
 */
VSF_CAL_WEAK(vsf_driver_init)
bool vsf_driver_init(void)
{
    // refer to vsf_hal_pre_startup_init implementation in startup file
    SCB_EnableICache();
    SCB_EnableDCache();

    vsf_hw_mpu_add_basic_resgions();
    return true;
}

/* EOF */
